# Data Concatenation

In [1]:
# import libraries
import pandas as pd

In [3]:
# Dataset 1
data1 = {'Name': ['Ahmed', 'Fatima', 'Ali'], 'Age': [28, 32, 24]}

# Dataset 2
data2 = {'Name': ['Sara', 'Usman', 'Aisha'], 'Age': [29, 35, 27]}

# Dataset 3 
data3 = {'City': ['Karachi', 'Lahore', 'Islamabad'], 'Province': ['Sindh', 'Punjab', 'Islamabad']}

data1 = pd.DataFrame(data1)
data2 = pd.DataFrame(data2)
data3 = pd.DataFrame(data3)

## Concatenating Rows

In [5]:
concat_rows = pd.concat([data1, data2])
concat_rows

     Name  Age
0   Ahmed   28
1  Fatima   32
2     Ali   24
0    Sara   29
1   Usman   35
2   Aisha   27

## Concatenating Columns

In [6]:
concat_columns = pd.concat([data1, data3], axis=1)
concat_columns

     Name  Age       City   Province
0   Ahmed   28    Karachi      Sindh
1  Fatima   32     Lahore     Punjab
2     Ali   24  Islamabad  Islamabad